{
  "topic": "Cohesive Devices Used in Various Types of Speech",
  "definitions": [
    {
      "number": 1,
      "title": "Understanding Cohesive Devices",
      "emoji": "🧩",
      "definition": "Cohesive devices are words or phrases that connect ideas smoothly within a speech or text.",
      "example": "Examples: however, therefore, in addition, although, for example",
      "explanation": "They help your speech sound natural and organized, guiding the audience through your ideas clearly."
    },
    {
      "number": 2,
      "title": "Introduction in a Speech",
      "emoji": "🎤",
      "definition": "The introduction is the part of the speech that captures attention and gives a preview of the main points.",
      "example": "Example: 'Today, I’ll be talking about the importance of communication in teamwork.'",
      "explanation": "It sets the tone for the speech and prepares the audience for what’s coming next."
    },
    {
      "number": 3,
      "title": "Body of the Speech",
      "emoji": "🧠",
      "definition": "The body of a speech discusses the main ideas and supporting details.",
      "example": "Example: 'First, let’s talk about how communication builds trust in a team.'",
      "explanation": "This section develops your message clearly and logically."
    },
    {
      "number": 4,
      "title": "Conclusion of the Speech",
      "emoji": "🎯",
      "definition": "The conclusion summarizes the main ideas and leaves a lasting impression.",
      "example": "Example: 'In summary, good communication is the heart of successful teamwork.'",
      "explanation": "It wraps up your thoughts and reinforces your main message."
    },
    {
      "number": 5,
      "title": "Using 'For Example', 'Additionally', and 'Furthermore'",
      "emoji": "🧾",
      "definition": "These cohesive devices add more information or examples to support your point.",
      "example": "Example: 'He is very kind. Furthermore, he helps his classmates when they need it.'",
      "explanation": "Use them when you want to give supporting details or additional points."
    },
    {
      "number": 6,
      "title": "Using 'Despite' and 'Although'",
      "emoji": "🌦️",
      "definition": "These devices show contrast between two ideas.",
      "example": "Example: 'Despite the rain, the event continued as planned.'",
      "explanation": "They connect opposite ideas, showing something unexpected or surprising."
    },
    {
      "number": 7,
      "title": "Using 'In Spite Of' and 'However'",
      "emoji": "⚖️",
      "definition": "‘In spite of’ introduces contrast, while ‘however’ transitions between opposing ideas.",
      "example": "Example: 'In spite of being tired, she finished her project. However, she submitted it late.'",
      "explanation": "These make your speech more dynamic and balanced by showing differences."
    },
    {
      "number": 8,
      "title": "Using 'As a Result' and 'Consequently'",
      "emoji": "🔗",
      "definition": "These cohesive devices show cause-and-effect relationships.",
      "example": "Example: 'He studied hard; as a result, he passed the exam.'",
      "explanation": "Use them to explain outcomes or consequences in your speech."
    },
    {
      "number": 9,
      "title": "Using 'First', 'Next', and 'Then'",
      "emoji": "🗂️",
      "definition": "These devices organize ideas in sequence or order.",
      "example": "Example: 'First, prepare your materials. Next, start crafting your design.'",
      "explanation": "They guide your audience step by step, especially in procedural or demonstrative speeches."
    },
    {
      "number": 10,
      "title": "Using 'However', 'In Addition', and 'For Example'",
      "emoji": "🗣️",
      "definition": "These are some of the most common cohesive devices that keep your speech connected and engaging.",
      "example": "Example: 'Most animals sleep like people do. However, horses sleep while standing up.'",
      "explanation": "They make transitions between ideas smooth and help your listeners follow your thoughts."
    }
  ]
}
