{
  "topic": "Quarter 1 - Module 3: Communicative Styles",
  "definitions": [
    {
      "number": 1,
      "title": "What Are Communicative Styles?",
      "emoji": "🗣️",
      "definition": "Communicative styles refer to the way we express ourselves when we talk to others. They depend on the situation, relationship, and purpose of the conversation.",
      "example": "Example: The way you talk to your best friend is different from how you talk to your teacher.",
      "explanation": "Each situation requires a different level of formality. Understanding these styles helps us communicate more effectively and respectfully."
    },
    {
      "number": 2,
      "title": "Frozen Style",
      "emoji": "❄️",
      "definition": "The frozen style is the most formal and fixed type of communication. The words are unchanging and often memorized or recited.",
      "example": "Example: Prayers, national anthems, oaths, and the Preamble of the Constitution.",
      "explanation": "This style does not change. It is often used in ceremonies, rituals, or formal declarations."
    },
    {
      "number": 3,
      "title": "Formal Style",
      "emoji": "🏛️",
      "definition": "The formal style is used in structured situations where precise language and grammar are important.",
      "example": "Example: Delivering a speech, reporting in class, or writing an academic paper.",
      "explanation": "This style avoids slang and contractions. It’s used when the speaker does not expect feedback during the communication."
    },
    {
      "number": 4,
      "title": "Consultative Style",
      "emoji": "👩‍🏫",
      "definition": "The consultative style is used in professional or semi-formal situations where feedback is expected.",
      "example": "Example: A student consulting a teacher or a patient talking to a doctor.",
      "explanation": "It involves respectful conversation with some exchange of information or clarification between participants."
    },
    {
      "number": 5,
      "title": "Casual Style",
      "emoji": "😄",
      "definition": "The casual style is used between friends or peers in informal situations. It often includes slang, jokes, and relaxed grammar.",
      "example": "Example: 'Hey dude, what’s up?' or 'Let’s hang out later!'",
      "explanation": "It’s spontaneous and natural, showing familiarity and comfort between speakers."
    },
    {
      "number": 6,
      "title": "Intimate Style",
      "emoji": "❤️",
      "definition": "The intimate style is used between people who are very close, such as family members, lovers, or best friends.",
      "example": "Example: 'Good night, honey.' or 'I love you, Mom.'",
      "explanation": "It often includes pet names, private language, or shared emotional expressions that only close people understand."
    },
    {
      "number": 7,
      "title": "Why Are Communicative Styles Important?",
      "emoji": "💬",
      "definition": "Knowing when to use each style helps us communicate effectively and respectfully.",
      "example": "Example: Using formal style in interviews and casual style when chatting with friends.",
      "explanation": "Each context has its appropriate tone and language. Choosing the right one builds better relationships and avoids misunderstandings."
    }
  ]
}
