{
  "topic": "The Informative Essay",
  "definitions": [
    {
      "number": 1,
      "title": "Informative Writing",
      "emoji": "🧠",
      "definition": "A style of writing that provides factual and objective information to educate the reader about a specific topic.",
      "example": "Example: Writing an essay about the process of photosynthesis.",
      "explanation": "Informative writing focuses on facts and explanations rather than opinions or persuasion."
    },
    {
      "number": 2,
      "title": "Functions of an Informative Essay",
      "emoji": "📚",
      "definition": "An informative essay aims to analyze, compare, and educate readers about facts and concepts.",
      "example": "Example: An essay comparing renewable and non-renewable energy sources.",
      "explanation": "It focuses on presenting knowledge clearly without convincing the reader to take a side."
    },
    {
      "number": 3,
      "title": "Outline",
      "emoji": "📝",
      "definition": "A plan or framework that organizes main ideas and supporting details before writing an essay.",
      "example": "Example: Introduction → Body → Conclusion.",
      "explanation": "An outline helps writers arrange their thoughts logically and ensures essay coherence."
    },
    {
      "number": 4,
      "title": "Accurate Facts",
      "emoji": "🎯",
      "definition": "Information that is true, correct, and verifiable from reliable sources.",
      "example": "Example: Water boils at 100°C under normal conditions.",
      "explanation": "Accuracy builds credibility and trust in informative writing."
    },
    {
      "number": 5,
      "title": "Parts of an Essay",
      "emoji": "📄",
      "definition": "The three main parts of an essay are the introduction, body, and conclusion.",
      "example": "Example: The introduction introduces the topic, the body explains it, and the conclusion summarizes the ideas.",
      "explanation": "Each part has a unique purpose that contributes to the essay’s clarity and completeness."
    },
    {
      "number": 6,
      "title": "Body of an Essay",
      "emoji": "💡",
      "definition": "The section that presents and explains the main ideas of the essay with supporting evidence.",
      "example": "Example: The body paragraph explaining the causes and effects of climate change.",
      "explanation": "It contains the important ideas and details that support the main topic."
    },
    {
      "number": 7,
      "title": "Characteristics of an Essay",
      "emoji": "📖",
      "definition": "An essay has a purpose, is organized into paragraphs, and has three main parts.",
      "example": "Example: An essay that informs readers about the importance of recycling.",
      "explanation": "Essays express organized thoughts and are written with a clear purpose."
    },
    {
      "number": 8,
      "title": "Pre-Writing Stage",
      "emoji": "🧩",
      "definition": "The stage before writing that involves choosing a topic, researching, and organizing ideas.",
      "example": "Example: Listing facts about renewable energy before writing the essay.",
      "explanation": "Pre-writing helps the writer gather ideas and information to build a solid essay structure."
    },
    {
      "number": 9,
      "title": "Introduction",
      "emoji": "🎬",
      "definition": "The opening part of an essay that introduces the main idea and captures the reader’s interest.",
      "example": "Example: 'Pollution is one of the most pressing problems in today’s world.'",
      "explanation": "It provides background and presents the topic clearly without examples or conclusions."
    },
    {
      "number": 10,
      "title": "Facts vs. Opinions",
      "emoji": "⚖️",
      "definition": "Facts are statements that can be proven true, while opinions are personal beliefs or judgments.",
      "example": "Example: Fact – The Earth orbits the Sun. Opinion – The Sun is the most beautiful star.",
      "explanation": "Informative essays rely on facts, not personal opinions, to maintain objectivity."
    },
    {
      "number": 11,
      "title": "Research",
      "emoji": "🔍",
      "definition": "The process of collecting reliable information to support the ideas presented in the essay.",
      "example": "Example: Using scientific journals and books to write an essay on climate change.",
      "explanation": "Research strengthens the essay by providing credible evidence for every claim."
    },
    {
      "number": 12,
      "title": "Paragraph",
      "emoji": "✏️",
      "definition": "A group of sentences arranged in a logical order that discusses one idea or topic.",
      "example": "Example: A paragraph explaining the benefits of reading daily.",
      "explanation": "Paragraphs organize ideas and help the essay flow smoothly."
    },
    {
      "number": 13,
      "title": "Editing",
      "emoji": "🧾",
      "definition": "The final step in writing an essay where the writer checks grammar, spelling, and organization.",
      "example": "Example: Revising sentences to correct errors and improve clarity.",
      "explanation": "Editing ensures the essay is polished, error-free, and ready to submit."
    }
  ]
}
