{
  "topic": "Understanding Text Connections and Social Awareness",
  "definitions": [
    {
      "number": 1,
      "title": "Dreams and Aspirations",
      "emoji": "🌟",
      "definition": "Valuing one’s dreams means finding ways to achieve life goals and not letting opportunities pass by.",
      "example": "Example: Maria studied hard to become a doctor despite financial struggles.",
      "explanation": "People who value their dreams take action toward them and stay committed even when facing difficulties."
    },
    {
      "number": 2,
      "title": "Understanding Discrimination",
      "emoji": "🚫",
      "definition": "Discrimination is the act of making unfair distinctions between people based on characteristics like race, gender, religion, or appearance.",
      "example": "Example: Ignoring someone because of their tattoos or skin color.",
      "explanation": "It happens when we treat people unfairly due to biases or stereotypes rather than who they truly are."
    },
    {
      "number": 3,
      "title": "Forms of Discrimination",
      "emoji": "⚖️",
      "definition": "Discrimination can occur through appearance, sexual orientation, disability, or other social identities.",
      "example": "Example: A man with tattoos being judged negatively by his neighbors.",
      "explanation": "Recognizing these forms helps us understand how prejudice manifests in daily life and why empathy matters."
    },
    {
      "number": 4,
      "title": "Effects of Discrimination",
      "emoji": "💔",
      "definition": "Discrimination can cause emotional pain, low self-esteem, and discourage people from reaching their dreams.",
      "example": "Example: Ted felt left out because his teacher gave more attention to another student.",
      "explanation": "It limits potential and harms both the individual and community, making kindness and equality important values."
    },
    {
      "number": 5,
      "title": "Fighting Discrimination",
      "emoji": "🤝",
      "definition": "One can counter discrimination by knowing one’s worth, being a good role model, and treating others with respect.",
      "example": "Example: Ana helps her classmates understand that everyone deserves equal treatment.",
      "explanation": "Respect, self-awareness, and compassion are the best weapons against unfair judgment and prejudice."
    },
    {
      "number": 6,
      "title": "Dreams and Life Values in Songs",
      "emoji": "🎵",
      "definition": "Songs like 'Ebony and Ivory' and 'River of Dreams' express values such as racial harmony, peace, and the pursuit of dreams.",
      "example": "Example: 'Ebony and Ivory live together in perfect harmony…'",
      "explanation": "Music teaches lessons about unity and equality, reminding us that all people deserve the same opportunities."
    },
    {
      "number": 7,
      "title": "Dealing with Discrimination",
      "emoji": "🧠",
      "definition": "Instead of fighting bullies physically, one should focus on strengths, seek support, and help oneself think clearly.",
      "example": "Example: Carlo ignored his classmates’ teasing and joined a support group for confidence.",
      "explanation": "Self-growth and calm problem-solving are better responses than anger or violence."
    },
    {
      "number": 8,
      "title": "Valuing Oneself",
      "emoji": "💪",
      "definition": "Knowing your worth helps you face discrimination and pursue dreams with courage.",
      "example": "Example: Liza continued to audition even after being rejected for her looks.",
      "explanation": "Confidence and self-acceptance help individuals stay true to their goals despite others’ opinions."
    }
  ]
}
